<?php
/** 
* 信息配置
* 
* @author XingShanghe<xingshanghe@gmail.com>
* @date 2015年5月29日下午1:53:02
* @source msgs.php 
* @version 1.0.0 
* @copyright  Copyright 2015 sobey.com 
*/ 

return [
    'MSG'=>[
        //
        '00000' =>  '操作成功',
        '00001' =>  '网络异常',
        '00002' =>  '响应超时',
        '00003' =>  '数据库操作失败',
        '00004' =>  '参数不合法',
        '00005' =>  'token已经失效不合法',
        '00006' =>  '请传入token',
        '00098' =>  '数据查询失败',
        '00099' =>  '未知错误',
        //10000+认证消息
        '10001' =>  '用户名密码不匹配', 
        '10002' =>  '缺少相应参数 %s',
        '10003' =>  '查无此用户',
        '10004' =>  '密码不正确',
        '10005' =>  'pin值不正确或失效',
        '10006' =>  '用户名/邮箱/手机号已被注册',
        '10007' =>  '用户名已被注册',
        '10008' =>  '邮箱已被注册',
        '10009' =>  '手机号已被注册',
        '10010' =>  '应用未被授权',
        //50000+加密解密信息
        '50001' =>  '加/解密数据为空或不合法',
            
    ],
];